# **Create & Access SQLite database using Python**

### **Objectives**

* Create a database
* Create a table
* Insert data into the table
* Query data from the table
* Retrieve the result set into Pandas DataFrame
* Close the database connection

SQLite is a software library that implements serverless, self-contained, transactional and zero-configuration SQL database engine.

#### Create database using SQLite

In [1]:
#Install & Load sqlite3
!pip install sqlite
import sqlite3

ERROR: Could not find a version that satisfies the requirement sqlite (from versions: none)
ERROR: No matching distribution found for sqlite

In [2]:
# Connecting to sqlite
# Connection object
conn = sqlite3.connect('INSTRUCTOR.db')

In [3]:
# Cursor object
cursor_obj = conn.cursor()

#### Create a table in the database

We will create a table in the database as per below: 

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/table.png" align="center">

Use `DROP` query to check if the database already exist.
Cursor object will help to execute the query and fetch the records from the database.

In [4]:
# Drop the table if it already exists
cursor_obj.execute("DROP TABLE IF EXISTS INSUTRUCTOR")

if the table doesn`t exist then you will get an error similar to the below: 


<strong>Exception: \[IBM]\[CLI Driver]\[DB2/LINUXX8664] SQL0204N  "ABC12345.INSTRUCTOR" is an undefined name.  SQLSTATE=42704 SQLCODE=-204</strong>

In [5]:
# Creating table

table = """ create table IF NOT EXISTS INSTRUCTOR(IF INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCDDE CHAR(2)); """

cursor_obj.execute(table)

print("Table is ready")

Table is ready

#### Insert data into the table

In [6]:
# Start by inserting the first column of data. 

cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [7]:
# Insert remaining 2 rows of data
cursor_obj.execute('''insert into INSTRUCTOR values(2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan','Chicago', 'US')''')

#### Query data in the table

In [8]:
# Retrieve data from the Instructor table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [9]:
# Fetch the rows from the table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
# to fetch new rows use fetchmany(numberofrows)
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [10]:
# Fetch only FNAME from the table
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_column = cursor_obj.fetchall()
for fetch in output_column:
    print(fetch)

All the data
('Rav',)
('Raul',)
('Hima',)

#### Write and execute an update statement that changes the Rav's CITY to MOOSETOWN

In [11]:
query_update = '''update INSTRUCTOR set CITY = 'Moosetown' where FNAME="Rav"'''
cursor_obj.execute(query_update)

In [12]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
    print(row)

All the data
(1, 'Rav', 'Ahuja', 'Moosetown', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

#### Retrieve data into Pandas

In [13]:
# retrieve the contents of the INSTRUCTOR table into a Pandas dataframe

import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;",conn)

#print the dataframe
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  Moosetown    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [14]:
# print just the LNAME for first row in the pandas dataframe
df.LNAME[0]

'Ahuja'

Once data has reached Pandas DataFrame, you can perform normal pandas operations.

In [15]:
df.shape

(3, 5)

#### Close the Connection

Free all resources by closing the connection.

In [17]:
#Close the connection
conn.close()